## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/21163216033)



<pre><code>Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00meukdy10z0qky&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00meukdy10z0qky&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 3, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_sa_to_hierarchical_group&#34;:
   3: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_sa_to_hierarchical_group&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/03fwokq04jj0scm&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/03fwokq04jj0scm&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 15, in resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_sa_to_hierarchical_group&#34;:
  15: resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_sa_to_hierarchical_group&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com&#39; in &#39;groups/01fob9te0l19xwg&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com&#39; in &#39;groups/01fob9te0l19xwg&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 27, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_restricted_markets_sa_to_hierarchical_group&#34;:
  27: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_restricted_markets_sa_to_hierarchical_group&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 41, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_prod_read&#34;:
  41: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-security-scanners@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 53, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_dev_read&#34;:
  53: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_dev_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.developers_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 65, in resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_prod_read&#34;:
  65: resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-developers@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.developers_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 77, in resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_dev_read&#34;:
  77: resource &#34;google_cloud_identity_group_membership&#34; &#34;developers_group_to_dev_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-markets-delivery@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-markets-delivery@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.markets_delivery_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 89, in resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_group_to_prod_read&#34;:
  89: resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/0184mhaj2tdduaw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 101, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_read&#34;:
 101: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/023ckvvd0rmgw6a&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/023ckvvd0rmgw6a&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_write,
  on restricted-registry-hierarchical-groups.tf line 113, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_write&#34;:
 113: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_dev_write&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 125, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_read&#34;:
 125: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/01egqt2p1a2johw&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-restricted-registry-image-builder@sap.com&#39; in &#39;groups/01egqt2p1a2johw&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_write,
  on restricted-registry-hierarchical-groups.tf line 136, in resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_write&#34;:
 136: resource &#34;google_cloud_identity_group_membership&#34; &#34;image_builder_group_to_prod_write&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
data.github_organization.kyma_project: Reading...
data.github_repository.gitleaks_repository["test-infra"]: Reading...
data.github_repository.test_infra: Reading...
data.github_repository.kyma_modules_internal: Reading...
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
google_service_account.sa-dev-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.kyma_modules_runtime_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-security-dashboard-oauth: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.kyma_modules_internal: Read complete after 1s [id=kyma-modules]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
module.signify_secret_rotator.google_service_account.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Reading...
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
google_service_account.gitleaks-secret-accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.dora_integration_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token]
google_service_account.image_syncer_reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
google_secret_manager_secret.image_builder_sa_key_restricted_markets: Refreshing state... [id=projects/sap-kyma-prow/secrets/image-builder-sa-key-restricted-markets]
google_service_account.kyma-modules-reader-modg: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.kyma_bot_public_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Read complete after 0s [id=projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1]
google_secret_manager_secret.internal_github_terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
google_secret_manager_secret.internal_github_terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform-executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_project.project: Reading...
google_service_account.restricted-markets-artifactregistry-reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform-planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
data.google_project.current: Reading...
data.google_client_config.gcp: Reading...
module.service_account_keys_cleaner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.kyma-submission-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.kyma-security-scanners: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.chainguard_pull_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token]
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
google_service_account.image_syncer_writer: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
google_service_account.kyma-oci-image-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.neighbors-conduit-cli-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/neighbors-conduit-cli-builder@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.sec-scanner-cfg-processor-gcp-sa-key: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 0s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
google_service_account.sa-secret-update: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Reading...
data.google_project.current: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.sec-scanner-cfg-processor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.kyma_developer_admin_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.viewer/group:kyma_developer_admin@sap.com]
module.dev_docker_repository.data.google_client_config.this: Reading...
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.kyma_modules.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache]
module.dev_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dockerhub_mirror.data.google_client_config.this: Reading...
module.dockerhub_mirror.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_private_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.privateLogViewer/group:kyma_developer_admin@sap.com]
module.docker_cache.data.google_client_config.this: Reading...
module.docker_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod]
module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod]
module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev]
module.kyma_restricted_images_dev.data.google_client_config.this: Reading...
module.kyma_restricted_images_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_service_account.kyma_project_image_builder: Refreshing state... [id=projects/kyma-project/serviceAccounts/azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
google_service_account.kyma_project_image_builder_restricted_markets: Refreshing state... [id=projects/kyma-project/serviceAccounts/img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com]
module.prod_docker_repository.data.google_client_config.this: Reading...
module.prod_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.chainguard_cache.data.google_client_config.this: Reading...
module.chainguard_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_modules.data.google_client_config.this: Reading...
module.kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev]
google_project_iam_member.kyma_developer_admin_editor: Refreshing state... [id=kyma-project/roles/editor/group:kyma_developer_admin@sap.com]
module.kyma_restricted_images_prod.data.google_client_config.this: Reading...
module.kyma_restricted_images_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
data.google_project.kyma_project: Reading...
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name: Refreshing state... [id=kyma-modules:KYMA_PROW_SERVICEUSER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 3s [id=test-infra]
google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:172960:repository_owner_id:2457:workflow:Update Component Version on Push]
module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/signify-secret-rotator]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_organization_variable.dora_integration_internal_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
github_actions_organization_variable.image_syncer_reader_service_account_email: Refreshing state... [id=IMAGE_SYNCER_READER_SERVICE_ACCOUNT_EMAIL]
data.github_repository.test_infra: Read complete after 3s [id=test-infra]
github_actions_variable.internal_github_terraform_planner_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_PLANNER_SECRET_NAME]
github_actions_organization_variable.dora_integration_public_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_PUBLIC_GITHUB_TOKEN_GCP_SECRET_NAME]
data.google_project.kyma_project: Read complete after 0s [id=projects/kyma-project]
github_actions_variable.internal_github_terraform_executor_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_EXECUTOR_SECRET_NAME]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.gcp_terraform_executor_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_EXECUTOR_SERVICE_ACCOUNT_EMAIL]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
google_service_account_iam_member.restricted_markets_artifactregistry_reader_impersonation: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:gcr-writer@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Reading...
google_secret_manager_secret_iam_member.chainguard_token_terraform_planner_access: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.gcp_terraform_planner_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_PLANNER_SERVICE_ACCOUNT_EMAIL]
google_storage_bucket_iam_binding.planner_state_bucket_write_access: Refreshing state... [id=b/tf-state-kyma-project/roles/storage.objectUser]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_executor_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_planner_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token/roles/s

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_cloud_identity_group_membership.developers_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "developers_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-developers@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.developers_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "developers_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-developers@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_dev_write will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write" {
      + create_time = (known after apply)
      + group       = "groups/023ckvvd0rmgw6a"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_prod_write will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write" {
      + create_time = (known after apply)
      + group       = "groups/01egqt2p1a2johw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/01fob9te0l19xwg"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-markets-delivery@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/03fwokq04jj0scm"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/00meukdy10z0qky"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.
google_cloud_identity_group_membership.security_scanners_group_to_prod_read: Creating...
google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.image_builder_group_to_dev_write: Creating...
google_cloud_identity_group_membership.security_scanners_group_to_dev_read: Creating...
google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.developers_group_to_prod_read: Creating...
google_cloud_identity_group_membership.image_builder_group_to_prod_read: Creating...
google_cloud_identity_group_membership.image_builder_group_to_dev_read: Creating...
google_cloud_identity_group_membership.markets_delivery_group_to_prod_read: Creating...
google_cloud_identity_group_membership.developers_group_to_dev_read: Creating...
google_cloud_identity_group_membership.image_builder_group_to_prod_write: Creating...
google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group: Creating...

Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00meukdy10z0qky' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00meukdy10z0qky' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 3, in resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group":
   3: resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/03fwokq04jj0scm' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/03fwokq04jj0scm' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 15, in resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group":
  15: resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com' in 'groups/01fob9te0l19xwg' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com' in 'groups/01fob9te0l19xwg' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group,
  on restricted-registry-hierarchical-groups.tf line 27, in resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group":
  27: resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 41, in resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read":
  41: resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-security-scanners@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 53, in resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read":
  53: resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.developers_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 65, in resource "google_cloud_identity_group_membership" "developers_group_to_prod_read":
  65: resource "google_cloud_identity_group_membership" "developers_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-developers@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.developers_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 77, in resource "google_cloud_identity_group_membership" "developers_group_to_dev_read":
  77: resource "google_cloud_identity_group_membership" "developers_group_to_dev_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-markets-delivery@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-markets-delivery@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.markets_delivery_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 89, in resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read":
  89: resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/0184mhaj2tdduaw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_read,
  on restricted-registry-hierarchical-groups.tf line 101, in resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read":
 101: resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/023ckvvd0rmgw6a' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/023ckvvd0rmgw6a' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_dev_write,
  on restricted-registry-hierarchical-groups.tf line 113, in resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write":
 113: resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_read,
  on restricted-registry-hierarchical-groups.tf line 125, in resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read":
 125: resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/01egqt2p1a2johw' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-restricted-registry-image-builder@sap.com' in 'groups/01egqt2p1a2johw' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.image_builder_group_to_prod_write,
  on restricted-registry-hierarchical-groups.tf line 136, in resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write":
 136: resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write" {

::error::OpenTofu exited with code 1.

```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":13745,"Program":"tfcmt","SHA1":"e7b03480e0b40454a72f729f5b38e645aae5fc19","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->